In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'A':1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1,index=list(range(4)), dtype = 'float32'),
                    'D': np.array([3] * 4, dtype = 'int32'),
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python',
                    'G': [2,2,4,4],
                    'H':[np.nan, 2,4,np.nan]})
df

     A          B    C  D      E       F  G    H
0  1.0 2013-01-02  1.0  3   test  Python  2  NaN
1  1.0 2013-01-02  1.0  3  train  Python  2  2.0
2  1.0 2013-01-02  1.0  3   test  Python  4  4.0
3  1.0 2013-01-02  1.0  3  train  Python  4  NaN

In [5]:
df.nunique(axis=0, dropna=True) #Valores únicos: axis = 0 -> linhas -- dropna = True -> ignora NaN

A    1
B    1
C    1
D    1
E    2
F    1
G    2
H    2
dtype: int64

In [7]:
df.drop_duplicates() #por padrão avalia se uma linha é exatamente igual a outra
df

     A          B    C  D      E       F  G    H
0  1.0 2013-01-02  1.0  3   test  Python  2  NaN
1  1.0 2013-01-02  1.0  3  train  Python  2  2.0
2  1.0 2013-01-02  1.0  3   test  Python  4  4.0
3  1.0 2013-01-02  1.0  3  train  Python  4  NaN

In [10]:
df.drop_duplicates(subset=['G'], keep='first') # Considerando a coluna G, mantendo o primeiro -- keep='last' -> mantém o último

     A          B    C  D     E       F  G    H
0  1.0 2013-01-02  1.0  3  test  Python  2  NaN
2  1.0 2013-01-02  1.0  3  test  Python  4  4.0

In [15]:
df.drop_duplicates(subset=['G'], keep= False)#keep = false -> remove todas as duplicatas

Empty DataFrame
Columns: [A, B, C, D, E, F, G, H]
Index: []